In [ ]:
# import libraries
import sqlite3 as sql

In [ ]:
# connect Python to SQL database
conn = sql.connect('database1.sqlite')

# SQL Python handle
cur = conn.cursor()

In [ ]:
# Week 2: SQL Basics

In [ ]:
# Week 2: SELECT
# SELECT column1, column2, column3, CONCAT(colx, ' ', coly)
#     function/expresion = column_operation
# FROM table_A;


# SQL code may be embedded in a programming language
# queries may be stored in a repository
# code belongs to employer enterprise
# good to comment the code  /* */

In [ ]:
# /* SELECT *(all)  FROM TABLE; */ 
cur.SELECT * FROM "alanparadise/nw"."employees";

In [ ]:
# /* SELECT column1, column2, column-n FROM TABLE_A; */ 
SELECT employeeid, lastname, firstname FROM "alanparadise/nw"."employees";

In [ ]:
# /* SELECT column1, column2, column-n, expression, function(params) FROM TABLE; */ 
SELECT lastname, firstname, hiredate,
    current_date, date_part('month', hiredate)
FROM "alanparadise/nw"."employees";

In [ ]:
# /* SELECT column1, column2, column-n, operation as "name_operation"  FROM TABLE; 
SELECT orderid, unitprice, quantity,
    unitprice*quantity  as "Total Value"
FROM "alanparadise/nw"."orderdetails";

In [ ]:
# /* SELECT column1, column2, column-n, function=to_char(parms)  FROM TABLE; */
SELECT lastname, firstname,
    to_char(hiredate, 'month') as "Hire Month"
FROM "alanparadise/nw"."employees";

In [ ]:
# /* SELECT CONCAT(column1,' ',column2,column-n) as "name_concat" FROM TABLE; */
SELECT CONCAT(firstname,' ', lastname) as "Name"
FROM "alanparadise/nw"."employees";

In [ ]:
# /* SELECT column1 || ' ' || column2 || ' ' || column3 || ' ' || column4 as  "name_concat" FROM TABLE; */

SELECT firstname || ' ' || lastname as "Name"
FROM "alanparadise/nw"."employees";

In [ ]:
# Week 2: WHERE 
# WHERE clause of the SELECT statement to set a CONDITION 
# to determine if a row from the input TABLE appears in the answer set
# if CONDITION is TRUE, the row appears in answer set


# SELECT column1, column2, column3, CONCAT(colx, ' ', coly),
#     function/expresion = column_operation
# FROM table_A 
# WHERE column-n = condition_val;


# CONDITION in WHERE has format: <operand> <operator> <operand>
# operands are columns, functions, expressions

# operators are: 
# =, != <>
# like, between, in
# >, >=, <, <=

In [ ]:
# /* select customerid, contactname, country
#from table customers in "alanparadise/nw"
# */
SELECT customerid, contactname, country
FROM "alanparadise/nw"."customers";

In [ ]:
# /* select customerid, contactname, country
#from table customers in "alanparadise/nw"
#where condition on rows: country='Brazil';
# */
SELECT customerid, contactname, country
FROM "alanparadise/nw"."customers"
    WHERE country = 'Brazil';

In [ ]:
# /* select customerid, contactname, country
# from table customers in "alanparadise/nw"
# where condition on rows: country<>'Brazil' (less than, greater than/not);
# */
SELECT customerid, contactname, country
FROM "alanparadise/nw"."customers"
    WHERE country <> 'Brazil';

In [ ]:
# /* select columns productid, productname, unitprice
# from table 'products' in "alanparadise/nw"
# where condition on rows: unitprice > 60;
# */
SELECT productid, productname, unitprice
FROM "alanparadise/nw"."products"
    WHERE unitprice > 60;

In [ ]:
# Week 2: LIKE 
# used for text/strings only (not numeric columns)
# '%':  zero or more of any characte 
# '_': exactly one of any character

In [ ]:
# /* select columns customerid, contactname, country
# from table 'customers' in "alanparadise/nw"
# where condition on rows: contactname like 'M%'; ('param%' starts with param)
# */

SELECT customerid, contactname, country
FROM "alanparadise/nw"."customers"
    WHERE contactname like 'M%';

In [ ]:
# /* select columns customerid, contactname, country
# from table 'customers' in "alanparadise/nw"
# where condition on rows: contactname like '_a%'; ('_param%' followd by )
# */

SELECT customerid, contactname, country
FROM "alanparadise/nw"."customers"
    WHERE contactname like '_a%';

In [ ]:
# Week 2: IN

# WHERE <operand> in (<val1>, <val2>, <val-n>,)
# <operand> = <val1> OR
# <operand> = <val2> OR
# <operand> = <val-n>


# value can be literal or column
# value must match data type of operand

In [ ]:
# /* select columns productid, productname, unitprice, supplierid
# from table 'products' in "alanparadise/nw"
# where condition on columns(in): supplierid in (2, 4, 6, 8); entries is column matches condition
# */
SELECT productid, productname, unitprice, supplierid
FROM "alanparadise/nw"."products"
    WHERE supplierid in (2, 4, 6, 8);

In [ ]:
# /* select columns supplierid, companyname, region
# from table 'region' in "alanparadise/nw"
# where condition on columns(in): region in ('LA', 'MI', 'OR'); entries is column matches condition
# */
SELECT supplierid, companyname, region
FROM "alanparadise/nw"."suppliers"
    WHERE region in ('LA', 'MI', 'OR');

In [ ]:
# Week 2: BETWEEN

# WHERE <operand> between (<val1>, <val2>)
# WHERE <operand> >= <val1> AND <= <val2>

# between is inclusive
# value must match data type of operand

In [ ]:
# /* select columns productid, productname, unitprice
# from table 'products' in "alanparadise/nw"
# where condition on columns(between): unitprice between 20 and 30; entries if column matches condition between values
# */
SELECT productid, productname, unitprice
FROM "alanparadise/nw"."products"
    WHERE unitprice between 20 and 30;

In [ ]:
# /* select lastname, firstname
# from table 'employees' in "alanparadise/nw"
# where condition on columns(between): lastname between 'A' and 'M'; entries if column matches condition between values
# */
SELECT lastname, firstname
FROM "alanparadise/nw"."employees"
    WHERE lastname between 'A' and 'M';

In [ ]:
# Week 2: BOOLEAN

# multiple conditions in a WHERE clause combined
# AND, OR, NOT

In [ ]:
# /* select columns customerid, contactname, region, country
# from table 'customers' in "alanparadise/nw"
#    where condition on columns(NOT): NOT country = 'Brazil'; entries if column matches condition NOT value
# */

SELECT customerid, contactname, region, country
FROM "alanparadise/nw"."customers"
    WHERE NOT country = 'Brazil';

In [ ]:
# /* select columns productname, supplierid, categoryid, unitprice, unitsinstock
# from table 'products' in "alanparadise/nw"
#    where condition on columns(AND/OR):
#    supplierid = 1 AND
#    (categoryid = 2 OR categoryid = 3 AND unitprice > 20) OR
#    unitsinstock < 12; use parenthesis in AND/OR expressions
# */

SELECT productname, supplierid, categoryid, unitprice, unitsinstock
FROM "alanparadise/nw"."products"
    WHERE supplierid = 1 AND
    (categoryid = 2 OR categoryid=3 AND unitprice > 20) OR
    unitsinstock < 12;

In [ ]:
# Week 2: DISTINCT 
# DISTINCT clause before column in the SELECT removes cuplicates from the answer set

In [ ]:
# Week 2: COUNT
# counts how many rows are in the table

In [ ]:
# /* select columns *(all)
# from table 'customers' in "alanparadise/nw"
# */

SELECT COUNT(*)
FROM "alanparadise/nw"."customers";

In [ ]:
# /* select columns country
# from table 'customers' in "alanparadise/nw"
# */

SELECT COUNT(country)
FROM "alanparadise/nw"."customers";

In [ ]:
# /* select distinc columns country (DONT repeat output)
# from table 'customers' in "alanparadise/nw"
# */

SELECT DISTINCT country
FROM "alanparadise/nw"."customers";

In [ ]:
# Week 2: ORDER BY
# ORDER BY (default descending desc)
# sorts the rows in the answer set

In [ ]:
# /* select distinc columns country (DONT repeat output)
# from table 'customers' in "alanparadise/nw"
# order by(sort)  country
# */

SELECT DISTINCT country
FROM "alanparadise/nw"."customers"
    ORDER BY  country;

In [ ]:
# /* select columns productname, unitprice
# from table 'products' in "alanparadise/nw"
# order by(sort)  productname;
# */

SELECT productname, unitprice
FROM "alanparadise/nw"."products"
    ORDER BY  productname;

In [ ]:
# /* select columns productname, unitprice
# from table 'products' in "alanparadise/nw"
# order by(sort)  unitprice asc;
# */

SELECT productname, unitprice
FROM "alanparadise/nw"."products"
    ORDER BY  unitprice asc;

In [ ]:
# # Week 2: LIMIT
# LIMIT X (repleaces TOP in MsSQL and FETCH in Oracle)
# limits the answers set output rows to X

In [ ]:
# /* select columns productname, unitprice
# from table 'products' in "alanparadise/nw"
# order by(sort)  unitprice desc limit 5;
# */

SELECT productname, unitprice
FROM "alanparadise/nw"."products"
    ORDER BY  unitprice desc limit 5;

In [ ]:
# Week 2: DATES
# when creating/inserting a date column in PostgreSQL, specify the date type

# DATE TYPES:
# date: stores a data as YYYY-MM-DD without time
# timestamp: stores date as YYYY-MM-DD:HH:mm:SS.ssss with timezone
# time: stores as times of day HH:mm:SS.ssss
# interval: stores the difference between 2 dates as years-months-days

In [ ]:
# PostgreSQL converts string into a binary number
# date/time value as UTC
# timestamp - 8bytes
# date - 4bytes

In [ ]:
# CAST
# convert a column or expression to a different data type
# CAST (val1 as type)
# value1::type

In [ ]:
/* select lastname, firstname
    function age( hiredate, birthdate)::text as "Hire Age"
from table 'employees' in "alanparadise/nw";
*/

SELECT lastname, firstname, 
    age( hiredate, birthdate)::text as "Hire Age"
FROM "alanparadise/nw"."employees";

In [ ]:
# PostgreSQL date functions

# age(val1, val2): calculates difference between 2 dates as interval
# current_date:  returns today's date
# current_time:  time right now
# current_timestamp:  current date and time
# extract:  returns part of a date as interval
# date_part: returns part of a date as interval
# date_trunc: returns part of a date truncated to a precision
# now: return time right now
# to_date: converts a string to date format
# to_timestamp: convert a string to timestamp format

In [ ]:
# /* select employeeid, lastname, firstname,
#     function:  extract(year from hiredate)
# from table 'employees' in "alanparadise/nw";
# */

SELECT employeeid, lastname, firstname, 
    extract(year from hiredate)
FROM "alanparadise/nw"."employees";

In [ ]:
# /* select employeeid, lastname, firstname,
#     function:  date_part('year', hiredate)
# from table 'employees' in "alanparadise/nw";
# */

SELECT employeeid, lastname, firstname, 
    date_part('year', hiredate)
FROM "alanparadise/nw"."employees";

In [ ]:
# /*convert input string date to format  */
SELECT to_date('20201211', 'YYYYMMDD')

In [ ]:
# NULL: the cell(column/row) has NO value
# not blanks, not zeros
# NULL in a cell can affect calculations
# cell with NULL will NOT affect an average
# cell with zeros will affect an average
#

In [ ]:
# /* select productid, productname, discontinued
# from table 'products' in "alanparadise/nw";
#     where discontinued = '0'
# */
SELECT productid, productname, discontinued
FROM "alanparadise/nw"."products"
    WHERE discontinued = '0';

In [ ]:
# /* update productid, productname, discontinued
# from table 'products' in "alanparadise/nw";
#     where discontinued is NULL;
# */
UPDATE "alanparadise/nw"."products"
    SET discontinued = NULL
    WHERE discontinued = '1';

In [ ]:
# commit SQL commands
conn.commit()

# close SQL handle
cur.close()